document.addEventListener('DOMContentLoaded', function() {
  const cssFile = document.querySelector('link[rel="stylesheet"]');
  cssFile.href += '?v=' + new Date().getTime();

  const captions = [
    "توضیح تصویر اول",
    "توضیح تصویر دوم",
    "توضیح تصویر سوم",
    "توضیح تصویر چهارم",
    "توضیح تصویر پنجم",
    "توضیح تصویر ششم",
    "توضیح تصویر هفتم",
    "توضیح تصویر هشتم",
    "توضیح تصویر نهم",
    "توضیح تصویر دهم",
    "توضیح تصویر یازدهم",
    "توضیح تصویر دوازدهم",
    "توضیح تصویر سیزدهم",
    "توضیح تصویر چهاردهم",
    "توضیح تصویر پانزدهم",
    "توضیح تصویر شانزدهم",
    "توضیح تصویر هفدهم",
    "توضیح تصویر هجدهم",
    "توضیح تصویر نوزدهم",
    "توضیح تصویر بیستم",
    "توضیح تصویر بیست و یکم",
    "توضیح تصویر بیست و دوم",
    "توضیح تصویر بیست و سوم",
    "توضیح تصویر بیست و چهارم",
    "توضیح تصویر بیست و پنجم",
    "توضیح تصویر بیست و ششم",
    "توضیح تصویر بیست و هفتم",
    "توضیح تصویر بیست و هشتم",
    "انجام ورزش‌های منظم به صورت گروهی سبب افزایش انگیزه و تعهد نسبت به ورزش شده که در نهایت نتایج مثبت بسزایی در پیش‌گیری و کنترل بیماری‌های قلبی عروقی خواهد داشت.",
    "بالا بودن چربی خون، چاقی، دیابت و … سبب شکل‌گیری پلاک‌هایی در رگ‌های خونی شده که باعث تنگ شدن آن‌ها و در نهایت، بروز سکته‌های قلبی و مغزی می‌شود.",
    "مصرف شیرینی، شکلات و سایر مواد غذایی که حاوی مقادیر بالایی قند ساده هستند، سبب افزایش ریسک ابتلا به بیماری‌های قلبی می‌شوند و احتمال بروز سکته قلبی را افزایش می‌دهند. با کاهش مصرف این مواد غذایی، به سلامت خود کمک کنید.",
    "توضیح تصویر سی و دوم",
    "توضیح تصویر سی و سوم",
    "توضیح تصویر سی و چهارم",
    "توضیح تصویر سی و پنجم",
    "توضیح تصویر سی و ششم",
    "انجام ورزش‌های هوازی مانند صخره‌نوردی باعث تقویت توان قلبی عروقی می‌شود.",
    "بالا بودن فشار خون، رابطه مستقیمی با بروز انواع بیماری‌های قلبی و عروقی دارد، با اندازه‌گیری منظم فشار خون و کنترل آن با به‌کارگیری سبک زندگی صحیح و مصرف داروهای مناسب، گام بلندی به سوی سلامتی بردارید.",
    "انجام ورزش‌هایی مانند دویدن به مدت حدود ۱۰ دقیقه در روز، خطر بروز بیماری‌های قلبی عروقی را به طور چشمگیری کاهش می‌دهد.",
    "افکار منفی که سبب بروز احساساتی از قبیل خشم، نگرانی و افسردگی می‌شوند، باعث تشدید بیماری های قلبی و همین‌طور افزایش ریسک بروز آن‌ها می‌شوند.",
    "مصرف روزانه هشت لیوان آب میتواند نقش موثری بر سلامت قلب و عروق شما داشته باشد.",
    "کمبود ویتامین D می‌تواند یکی از عوامل بروز بیماری های قلبی باشد، با مصرف مواد غذایی حاوی ویتامین D مانند شیر و انواع ماهی‌ها و همچنین استفاده از مکمل‌ها و قرار گرفتن در معرض نور خورشید، کمبود این ویتامین را در بدن جبران کنید.",
    "مصرف زیاد غذاهای چرب از جمله کله پاچه می‌تواند به انسداد عروق و مشکلات قلبی منجر شود.",
    "اختصاص زمان‌هایی به مدیتیشن و تمرینات تمرکز، می‌تواند باعث تقویت آرامش شده و استرس را کاهش دهد و به کنترل بیماری‌های قلبی کمک کند.",
    "آلودگی هوا باعث افزایش التهاب در بدن می‌شود که این وضعیت خطر ابتلا به بیماری‌های قلبی، از جمله سکته قلبی را افزایش می‌دهد. پس با استفاده از ماسک مناسب و عدم ترک منزل در زمان افزایش آلودگی هوا، به سلامت خود کمک کنید.",
    "مراجعه به روانشناس از طریق کاهش استرس و اضطراب و همچنین توصیه‌های رفتاری مناسب می‌تواند نقش موثری در سلامت قلبی داشته باشد.",
    "چکاپ‌های پزشکی منظم باعث تشخیص زودهنگام بیماری‌های قلبی و مدیریت مناسب این بیماری‌ها شده و سبب افزایش طول عمر و کیفیت زندگی می‌شود.",
    "کشیدن قلیان تاثیرات مخربی بر سیستم‌های مختلف بدن از جمله سیستم قلبی عروقی دارد و می‌تواند سبب افزایش فشار خون، کاهش خون‌رسانی به بافت‌های مختلف و نارسایی قلبی شود.",
    "توضیح تصویر چهل و نهم",
    "توضیح تصویر پنجاهم",
    "توضیح تصویر پنجاه و یکم",
    "استفاده از گوشت سفید مانند مرغ و ماهی به جای گوشت قرمز، با کاهش سطح کلسترول و چربی های اشباع به بهبود عملکرد قلب کمک می‌کند.",
    "استفاده از پله به جای آسانسور، عضلات قلب را تقویت می‌کند و گردش خون را بهبود می‌بخشد، این عادت ساده، فشار خون را کاهش داده و خطر بیماری‌های قلبی را کم می‌کند.",
    "کوه‌نوردی به بهبود ظرفیت تنفسی، کاهش استرس و کاهش فشار خون کمک می‌کند که در نهایت منجر به بهبود سلامت قلب می‌شود.",
    "توضیح تصویر پنجاه و پنجم",
    "توضیح تصویر پنجاه و ششم",
    "گنجاندن مقادیر کافی سبزیجات در رژیم غذایی روزانه باعث کاهش فشار خون، کاهش کلسترول و بهبود عملکرد عروق شده و سبب کاهش خطر بروز بیماری های قلبی می‌شود.",
    "توضیح تصویر پنجاه و هشتم",
    "مصرف شیرینی‌ها و غذاهای حاوی قندهای افزودنی می‌تواند تاثیرات منفی زیادی بر سلامت قلب و عروق داشته باشد.",
    "توضیح تصویر شصتم",
    "مصرف سیگار باعث تنگی عروق، افزایش فشار خون، کاهش سطح اکسیژن خون و در نتیجه فشار بر عضله قلب می‌شود و به همین علت افراد سیگاری ۲ تا ۴ برابر بقیه افراد، به بیماری‌های قلبی عروقی دچار می‌شوند.",
    "توضیح تصویر شصت و دوم",
    "توضیح تصویر شصت و سوم"
  ];

  const grid = document.querySelector('.grid');
  const modal = document.getElementById('modal');
  const modalImg = document.getElementById('img01');
  const captionText = document.getElementById('caption');
  const closeModal = () => modal.style.display = 'none';

  grid.addEventListener('click', function(event) {
    if (event.target.classList.contains('cell')) {
      const index = Array.from(grid.children).indexOf(event.target);
      modal.style.display = 'flex';
      modalImg.src = event.target.style.backgroundImage.slice(5, -2);
      captionText.textContent = captions[index];
    }
  });

  document.querySelector('.close').addEventListener('click', closeModal);

  modal.addEventListener('click', function(event) {
    if (event.target === modal) {
      closeModal();
    }
  });

  document.querySelector('.modal-content').addEventListener('click', function(event) {
    event.stopPropagation();
  });
});

window.onload = function() {
  const modal = document.getElementById('modal');
  modal.style.display = 'none';
};